# Bailey Sweis
## week 14: 4/21/22
## python - pandas (groupby, apply, and map)

In [1]:
import numpy as np

from pandas import DataFrame, Series
import pandas as pd

In [2]:
#mapping 
df = DataFrame({'city': ['Alma','Brian Head','Fox Park','Lake Mary'],
               'altitude': [10355, 9800,9062,8966]})
df

         city  altitude
0        Alma     10355
1  Brian Head      9800
2    Fox Park      9062
3   Lake Mary      8966

In [3]:
st_map={'Alma':'Colorado','Brian Head': 'Utah','Fox Park': 'Wyoming','Lake Mary':'California'}
st_map

{'Alma': 'Colorado',
 'Brian Head': 'Utah',
 'Fox Park': 'Wyoming',
 'Lake Mary': 'California'}

In [5]:
df['state'] = df['city'].map(st_map)

In [6]:
df

         city  altitude       state
0        Alma     10355    Colorado
1  Brian Head      9800        Utah
2    Fox Park      9062     Wyoming
3   Lake Mary      8966  California

In [7]:
#apply
def meter(x):
    return x / 3.2808

In [8]:
meter(19)

5.7912704218483295

In [9]:
df['altitude'] = df['altitude'].apply(meter)

In [10]:
df

         city     altitude       state
0        Alma  3156.242380    Colorado
1  Brian Head  2987.076323        Utah
2    Fox Park  2762.131188     Wyoming
3   Lake Mary  2732.870032  California

In [11]:
df['altitude'] = df['altitude'].apply(lambda x: np.nan if x < 2800 else x)
df

         city     altitude       state
0        Alma  3156.242380    Colorado
1  Brian Head  2987.076323        Utah
2    Fox Park          NaN     Wyoming
3   Lake Mary          NaN  California

In [12]:
df['altitude'] = df['altitude'].apply(lambda x: x*3.2808)

In [13]:
df

         city  altitude       state
0        Alma   10355.0    Colorado
1  Brian Head    9800.0        Utah
2    Fox Park       NaN     Wyoming
3   Lake Mary       NaN  California

In [14]:
df = DataFrame(np.random.randn(4,3), columns=list('bde'), index = ['UT','OH','TX','OR'])

In [15]:
df

           b         d         e
UT -1.066585 -1.454483  0.437490
OH -0.452470  0.008957  1.512896
TX -1.862528  0.647222 -0.867108
OR  0.041771  0.386491 -1.345127

In [18]:
def dif(x):
    return x.max() - x.min()

In [19]:
df.apply(dif)

b    1.904299
d    2.101705
e    2.858023
dtype: float64

In [20]:
df.apply(dif, axis = 1)

UT    1.891973
OH    1.965366
TX    2.509751
OR    1.731617
dtype: float64

In [21]:
df

           b         d         e
UT -1.066585 -1.454483  0.437490
OH -0.452470  0.008957  1.512896
TX -1.862528  0.647222 -0.867108
OR  0.041771  0.386491 -1.345127

In [22]:
df.apply(lambda x: x.max() - x.min())

b    1.904299
d    2.101705
e    2.858023
dtype: float64

In [23]:
df.apply(lambda x: x.max() - x.min(), axis = 1)

UT    1.891973
OH    1.965366
TX    2.509751
OR    1.731617
dtype: float64

In [24]:
df.apply(pd.value_counts)

             b    d    e
-1.862528  1.0  NaN  NaN
-1.454483  NaN  1.0  NaN
-1.345127  NaN  NaN  1.0
-1.066585  1.0  NaN  NaN
-0.867108  NaN  NaN  1.0
-0.452470  1.0  NaN  NaN
 0.008957  NaN  1.0  NaN
 0.041771  1.0  NaN  NaN
 0.386491  NaN  1.0  NaN
 0.437490  NaN  NaN  1.0
 0.647222  NaN  1.0  NaN
 1.512896  NaN  NaN  1.0

In [28]:
df.apply(pd.value_counts).fillna(0).astype(int)

           b  d  e
-1.862528  1  0  0
-1.454483  0  1  0
-1.345127  0  0  1
-1.066585  1  0  0
-0.867108  0  0  1
-0.452470  1  0  0
 0.008957  0  1  0
 0.041771  1  0  0
 0.386491  0  1  0
 0.437490  0  0  1
 0.647222  0  1  0
 1.512896  0  0  1

In [30]:
df = DataFrame({'k1':['a','a','b','b','c'], 'k2':['one','two','one','two','one'],
               'dataset1':np.random.randn(5),
               'dataset2': np.random.randn(5)})

In [31]:
df

  k1   k2  dataset1  dataset2
0  a  one  0.126606  0.692537
1  a  two  0.114114  0.494168
2  b  one -0.009348 -0.726019
3  b  two -0.048172  0.081058
4  c  one -0.215765 -0.906212

In [32]:
df.groupby('k1').count()

    k2  dataset1  dataset2
k1
a    2         2         2
b    2         2         2
c    1         1         1

In [33]:
df.groupby('k1').size()

k1
a    2
b    2
c    1
dtype: int64

In [34]:
df.groupby('k1').mean()

    dataset1  dataset2
k1
a   0.120360  0.593352
b  -0.028760 -0.322481
c  -0.215765 -0.906212

In [35]:
df.groupby('k2').size()

k2
one    3
two    2
dtype: int64

In [36]:
df.groupby('k2').mean()

     dataset1  dataset2
k2
one -0.032835 -0.313231
two  0.032971  0.287613

In [37]:
df.groupby(['k1', 'k2']).count()

        dataset1  dataset2
k1 k2
a  one         1         1
   two         1         1
b  one         1         1
   two         1         1
c  one         1         1

In [38]:
df.groupby(['k1', 'k2']).mean()

        dataset1  dataset2
k1 k2
a  one  0.126606  0.692537
   two  0.114114  0.494168
b  one -0.009348 -0.726019
   two -0.048172  0.081058
c  one -0.215765 -0.906212

In [40]:
df.groupby('k1').sum()

    dataset1  dataset2
k1
a   0.240720  1.186704
b  -0.057520 -0.644961
c  -0.215765 -0.906212

In [42]:
df['dataset1'].groupby(df['k1']).mean()

k1
a    0.120360
b   -0.028760
c   -0.215765
Name: dataset1, dtype: float64

In [43]:
df.groupby('k1').mean()

    dataset1  dataset2
k1
a   0.120360  0.593352
b  -0.028760 -0.322481
c  -0.215765 -0.906212

In [44]:
group = df.groupby(['k1', 'k2'])

In [45]:
group.count()

        dataset1  dataset2
k1 k2
a  one         1         1
   two         1         1
b  one         1         1
   two         1         1
c  one         1         1

In [47]:
group.sum()

        dataset1  dataset2
k1 k2
a  one  0.126606  0.692537
   two  0.114114  0.494168
b  one -0.009348 -0.726019
   two -0.048172  0.081058
c  one -0.215765 -0.906212

In [48]:
group = df.groupby(['k1', 'k2'])[['dataset1']]

In [49]:
group

In [50]:
group.count()

        dataset1
k1 k2
a  one         1
   two         1
b  one         1
   two         1
c  one         1

In [51]:
group.sum()

        dataset1
k1 k2
a  one  0.126606
   two  0.114114
b  one -0.009348
   two -0.048172
c  one -0.215765

In [52]:
group.mean()

        dataset1
k1 k2
a  one  0.126606
   two  0.114114
b  one -0.009348
   two -0.048172
c  one -0.215765